// Получение элементов
const daysSelect = document.getElementById("day");
const monthsSelect = document.getElementById("month");
const yearsSelect = document.getElementById("year");

// Массив месяцев
const months = [
    "Январь", "Февраль", "Март", "Апрель", "Май", "Июнь",
    "Июль", "Август", "Сентябрь", "Октябрь", "Ноябрь", "Декабрь"
];

for (let i = 1; i <= 31; i++) {
    const option = document.createElement("option");
    const day_view = i < 10 ? `0${i}` : `${i}`;
    option.value = day_view;
    option.textContent = i;
    daysSelect.appendChild(option);
}

// Заполнение списка с месяцами
months.forEach((month, index) => {
    const option = document.createElement("option");
    const month_view = index < 9 ? `0${index + 1}` : `${index + 1}`;
    option.value = month_view;
    option.textContent = month;
    monthsSelect.appendChild(option);
});

// Заполнение списка с годами
const dt = new Date();
const min_year = dt.getFullYear() - 12; // например, минимальный возраст 12 лет
for (let year = min_year; year >= 1925; year--) {
    const option = document.createElement("option");
    option.value = year;
    option.textContent = year;
    yearsSelect.appendChild(option);
}

// Функция для определения високосного года
function isLeapYear(year) {
    return (year % 4 === 0 && year % 100 !== 0) || (year % 400 === 0);
}

// Функция для обновления дней в зависимости от месяца и года
function updateDays() {
    const selectedYear = parseInt(yearsSelect.value);
    const selectedMonth = parseInt(monthsSelect.value);

    // Определяем количество дней в месяце
    let daysInMonth;
    if (selectedMonth === 2) { // февраль
        daysInMonth = isLeapYear(selectedYear) ? 29 : 28;
    } else if ([4, 6, 9, 11].includes(selectedMonth)) { // апрель, июнь, сентябрь, ноябрь
        daysInMonth = 30;
    } else { // остальные месяцы
        daysInMonth = 31;
    }

    // Сохраняем текущий выбранный день
    const currentDay = daysSelect.value;

    // Очищаем список дней
    daysSelect.innerHTML = '';
    
    const placeholderOption = document.createElement("option");
    placeholderOption.value = "";
    placeholderOption.textContent = "День";
    placeholderOption.disabled = true; // чтобы его нельзя было выбрать после выбора другого
    placeholderOption.selected = true; // чтобы он был выбран по умолчанию
    daysSelect.appendChild(placeholderOption);

    // Заполняем список днями по количеству дней в месяце
    for (let i = 1; i <= daysInMonth; i++) {
        const option = document.createElement("option");
        const day_view = i < 10 ? `0${i}` : `${i}`;
        option.value = day_view;
        option.textContent = i;
        daysSelect.appendChild(option);
    }

    // Если ранее выбранный день больше нового максимума, выбираем последний допустимый день
    if (currentDay && parseInt(currentDay) <= daysInMonth) {
        daysSelect.value = currentDay;
    }
    else if (currentDay && parseInt(currentDay) > daysInMonth){
        // Иначе выбираем последний день месяца по умолчанию
        daysSelect.value = daysInMonth < 10 ? `0${daysInMonth}` : `${daysInMonth}`;
    } 
}

const birthtime_input = document.getElementById('birthtime');
const birthtime_check = document.getElementById('birthtime_check');
birthtime_check.addEventListener('change', function() {
    birthtime_input.disabled = this.checked; // если чекбокс отмечен, input станет неактивным
    birthtime_input.style.color = '#d2ccff';
    birthtime_input.value = "12:00";
    
  });


// Обработчики изменения месяца и года
monthsSelect.addEventListener('change', updateDays);
yearsSelect.addEventListener('change', updateDays);


// Выбираем что внешность партнера неважна
document.getElementById("not").addEventListener("click",
    function notneed() {
    document.getElementById("notneedlook").style.display = "none";
   });

// Выбираем что внешность партнера важна
document.getElementById("need").addEventListener("click",
    function need() {
    document.getElementById("notneedlook").style.display = "block";
   });
   
   // Выбираем что моя внешность неважна
document.getElementById("notmylook").addEventListener("click",
    function notneedmy() {
    document.getElementById("notneedmylook").style.display = "none";
   });

// Выбираем что моя внешность важна
document.getElementById("yesmylook").addEventListener("click",
    function needmy() {
    document.getElementById("notneedmylook").style.display = "block";
   });

   
  // Выбираем что мой характер  неважен
document.getElementById("notychar").addEventListener("click",
    function notneedmychar() {
    document.getElementById("notneedmychar").style.display = "none";
  });

// Выбираем что мой характер важен
document.getElementById("yesychar").addEventListener("click",
    function needmychar() {
    document.getElementById("notneedmychar").style.display = "block";
  });
   
  // Выбираем что характер партнера неважен
document.getElementById("notchar").addEventListener("click",
    function notneedchar() {
    document.getElementById("notneedchar").style.display = "none";
  });

// Выбираем что характер партнера важен
document.getElementById("yeschar").addEventListener("click",
    function needchar() {
    document.getElementById("notneedchar").style.display = "block";
  });
   


const select_country = document.getElementById('birthcountry');
const suggest_country = document.getElementById('suggest_country');

const countries = [
    'Афганистан',
    'Албания',
    'Алжир',
    'Андорра',
    'Ангола',
    'Антигуа и Барбуда',
    'Азербайджан',
    'Аргентина',
    'Австралия',
    'Австрия',
    'Багамские Острова',
    'Бахрейн',
    'Бангладеш',
    'Армения',
    'Барбадос',
    'Бельгия',
    'Бутан',
    'Боливия',
    'Босния и Герцеговина',
    'Ботсвана',
    'Бразилия',
    'Белиз',
    'Соломоновы Острова',
    'Бруней',
    'Болгария',
    'Вьетнам',
    'Мьянма',
    'Бурунди',
    'Белоруссия',
    'Камбоджа',
    'Камерун',
    'Канада',
    'Кабо-Верде',
    'Центральноафриканская Республика',
    'Шри-Ланка',
    'Чад',
    'Чили',
    'Китай',
    'Колумбия',
    'Коморы',
    'Республика Конго',
    'Демократическая Республика Конго',
    'Коста-Рика',
    'Хорватия',
    'Куба',
    'Кипр',
    'Чехия',
    'Бенин',
    'Дания',
    'Доминика',
    'Доминиканская Республика',
    'Эквадор',
    'Сальвадор',
    'Экваториальная Гвинея',
    'Эфиопия',
    'Эритрея',
    'Эстония',
    'Фиджи',
    'Финляндия',
    'Аландские острова',
    'Франция',
    'Джибути',
    'Габон',
    'Грузия',
    'Гамбия',
    'Палестина',
    'Германия',
    'Гана',
    'Кирибати',
    'Греция',
    'Гренландия',
    'Гренада',
    'Гватемала',
    'Гвинея',
    'Гайана',
    'Республика Гаити',
    'Ватикан',
    'Гондурас',
    'Джубути',
    'Гонконг',
    'Венгрия',
    'Исландия',
    'Индия',
    'Индонезия',
    'Иран',
    'Ирак',
    'Ирландия',
    'Израиль',
    'Италия',
    'Кот-д’Ивуар',
    'Ямайка',
    'Япония',
    'Казахстан',
    'Иордания',
    'Кения',
    'Северная Корея',
    'Южная Корея',
    'Кувейт',
    'Киргизия',
    'Лаос',
    'Ливан',
    'Лесото',
    'Латвия',
    'Либерия',
    'Ливия',
    'Лихтенштейн',
    'Литва',
    'Люксембург',
    'Макао',
    'Мадагаскар',
    'Малави',
    'Малайзия',
    'Мальдивы',
    'Мали',
    'Мальта',
    'Мартиника',
    'Мавритания',
    'Маврикий',
    'Мексика',
    'Монако',
    'Монголия',
    'Молдавия',
    'Черногория',
    'Монтсеррат',
    'Марокко',
    'Мозамбик',
    'Оман',
    'Острова Кука',
    'Намибия',
    'Науру',
    'Непал',
    'Нидерланды',
    'Кюрасао',
    'Аруба',
    'Синт-Мартен',
    'Новая Каледония',
    'Вануату',
    'Новая Зеландия',
    'Никарагуа',
    'Нигер',
    'Нигерия',
    'Норвегия',
    'Северная Македония',
    'Микронезия',
    'Маршалловы Острова',
    'Палау',
    'Пакистан',
    'Панама',
    'Папуа — Новая Гвинея',
    'Парагвай',
    'Перу',
    'Филиппины',
    'Польша',
    'Португалия',
    'Гвинея-Бисау',
    'Восточный Тимор',
    'Пуэрто-Рико',
    'Катар',
    'Румыния',
    'Россия',
    'Республика Абхазия',
    'Руанда',
    'Сент-Китс и Невис',
    'Сент-Люсия',
    'Сен-Пьер и Микелон',
    'Сент-Винсент и Гренадины',
    'Сан-Марино',
    'Сан-Томе и Принсипи',
    'Саудовская Аравия',
    'Сенегал',
    'Сербия',
    'Республика Сейшельские Острова',
    'Сьерра-Леоне',
    'Сингапур',
    'Словакия',
    'Словения',
    'Сомали',
    'Южно-Африканская Республика',
    'Зимбабве',
    'Испания',
    'Южный Судан',
    'Судан',
    'Суринам',
    'Эсватини',
    'Швеция',
    'Швейцария',
    'Сирия',
    'Таджикистан',
    'Таиланд',
    'Того',
    'Тонга',
    'Объединенные Арабские Эмираты',
    'Тунис',
    'Турция',
    'Туркменистан',
    'Тувалу',
    'Уганда',
    'Украина',
    'Египет',
    'Великобритания',
    'Гернси',
    'Джерси',
    'Танзания',
    'Соединенные Штаты Америки',
    'Буркина-Фасо',
    'Уругвай',
    'Узбекистан',
    'Венесуэла',
    'Самоа',
    'Йемен',
    'Замбия',
];

select_country.addEventListener('input', function() {
    const inputValue = this.value.toLowerCase();
    suggest_country.innerHTML = '';
    
    if (inputValue.length > 0) {
        let filteredCountries = countries.filter(country => {
            // country.toLowerCase().startsWith(inputValue)
            
            const words = country.toLowerCase().split(/\s+/);
            // Проверяем, есть ли слово, начинающееся с inputValue
            return words.some(word => word.startsWith(inputValue));
        });
        
        if (filteredCountries.length > 0) {
            if (filteredCountries.length > 15) {
                filteredCountries = filteredCountries.slice(0, 15);
            }
            
            filteredCountries.forEach(country => {
                const li = document.createElement('li');
                li.textContent = country;
                li.addEventListener('click', function() {
                    select_country.value = this.textContent;
                    suggest_country.innerHTML = '';
                });
                suggest_country.appendChild(li);
            });
            
            suggest_country.style.display = 'block';
        } else {
            suggest_country.style.display = 'none';

        }
        
    } else {
        suggest_country.style.display = 'none';
    }
});

const select_current_country = document.getElementById('current_country');
const suggest_current_country = document.getElementById('suggest_current_country');

select_current_country.addEventListener('input', function() {
    const inputValue = this.value.toLowerCase();
    suggest_current_country.innerHTML = '';
    
    if (inputValue.length > 0) {
        let filteredCountries = countries.filter(country => {
            // country.toLowerCase().startsWith(inputValue)
            
            const words = country.toLowerCase().split(/\s+/);
            // Проверяем, есть ли слово, начинающееся с inputValue
            return words.some(word => word.startsWith(inputValue));
        });
        
        if (filteredCountries.length > 0) {
            if (filteredCountries.length > 15) {
                filteredCountries = filteredCountries.slice(0, 15);
            }
            
            filteredCountries.forEach(country => {
                const li = document.createElement('li');
                li.textContent = country;
                li.addEventListener('click', function() {
                    select_current_country.value = this.textContent;
                    suggest_current_country.innerHTML = '';
                });
                suggest_current_country.appendChild(li);
            });
            
            suggest_current_country.style.display = 'block';
        } else {
            suggest_current_country.style.display = 'none';
        }
        
    } else {
        suggest_current_country.style.display = 'none';
    }
});

const select_city = document.getElementById('birthcity');
const suggest_city = document.getElementById('suggest_city');


const cities = [
    "Абаза (Республика Хакасия)",  
    "Абакан (Республика Хакасия)",  
    "Абдулино (Оренбургская область)",  
    "Абинск (Краснодарский край)",  
    "Агидель (Республика Башкортостан)",  
    "Агрыз (Республика Татарстан)",  
    "Адыгейск (Республика Адыгея)",  
    "Азнакаево (Республика Татарстан)",  
    "Азов (Ростовская область)",  
    "Ак-Довурак (Республика Тыва)",  
    "Аксай (Ростовская область)",  
    "Алагир (Республика Северная Осетия — Алания)",  
    "Алапаевск (Свердловская область)",  
    "Алатырь (Чувашская Республика)",  
    "Алдан (Республика Саха — Якутия)",  
    "Алейск (Алтайский край)",  
    "Александров (Владимирская область)",  
    "Александровск (Пермский край)",  
    "Александровск-Сахалинский (Сахалинская область)",  
    "Алексеевка (Белгородская область)",  
    "Алексин (Тульская область)",  
    "Алзамай (Иркутская область)",  
    "Алупка (Республика Крым)",  
    "Алушта (Республика Крым)",  
    "Альметьевск (Республика Татарстан)",  
    "Амурск (Хабаровский край)",  
    "Анадырь (Чукотский автономный округ)",  
    "Анапа (Краснодарский край)",  
    "Ангарск (Иркутская область)",  
    "Андреаполь (Тверская область)",  
    "Анжеро-Судженск (Кемеровская область)",  
    "Анива (Сахалинская область)",  
    "Апатиты (Мурманская область)",  
    "Апрелевка (Московская область)",  
    "Апшеронск (Краснодарский край)",  
    "Арамиль (Свердловская область)",  
    "Аргун (Чеченская Республика)",  
    "Ардатов (Республика Мордовия)",  
    "Ардон (Республика Северная Осетия — Алания)",  
    "Арзамас (Нижегородская область)",  
    "Аркадак (Саратовская область)",  
    "Армавир (Краснодарский край)",  
    "Армянск (Республика Крым)",  
    "Арсеньев (Приморский край)",  
    "Арск (Республика Татарстан)",  
    "Артём (Приморский край)",  
    "Артёмовск (Красноярский край)",  
    "Артёмовский (Свердловская область)",  
    "Архангельск (Архангельская область)",  
    "Асбест (Свердловская область)",  
    "Асино (Томская область)",  
    "Астрахань (Астраханская область)",  
    "Аткарск (Саратовская область)",  
    "Ахтубинск (Астраханская область)",  
    "Ачинск (Красноярский край)",  
    "Аша (Челябинская область)",  
    "Бабаево (Вологодская область)",  
    "Бабушкин (Республика Бурятия)",  
    "Бавлы (Республика Татарстан)",  
    "Багратионовск (Калининградская область)",  
    "Байкальск (Иркутская область)",  
    "Баймак (Республика Башкортостан)",  
    "Бакал (Челябинская область)",  
    "Баксан (Кабардино-Балкарская Республика)",  
    "Балабаново (Калужская область)",  
    "Балаково (Саратовская область)",  
    "Балахна (Нижегородская область)",  
    "Балашиха (Московская область)",  
    "Балашов (Саратовская область)",  
    "Балей (Забайкальский край)",  
    "Балтийск (Калининградская область)",  
    "Барабинск (Новосибирская область)",  
    "Барнаул (Алтайский край)",  
    "Барыш (Ульяновская область)",  
    "Батайск (Ростовская область)",  
    "Бахчисарай (Республика Крым)",  
    "Бежецк (Тверская область)",  
    "Белая Калитва (Ростовская область)",  
    "Белая Холуница (Кировская область)",  
    "Белгород (Белгородская область)",  
    "Белебей (Республика Башкортостан)",  
    "Белёв (Тульская область)",  
    "Белинский (Пензенская область)",  
    "Белово (Кемеровская область)",  
    "Белогорск (Амурская область)",  
    "Белогорск (Республика Крым)",  
    "Белозерск (Вологодская область)",  
    "Белокуриха (Алтайский край)",  
    "Беломорск (Республика Карелия)",  
    "Белорецк (Республика Башкортостан)",  
    "Белореченск (Краснодарский край)",  
    "Белоусово (Калужская область)",  
    "Белоярский (Ханты-Мансийский автономный округ — Югра)",  
    "Белый (Тверская область)",  
    "Бердск (Новосибирская область)",  
    "Березники (Пермский край)",  
    "Берёзовский (Свердловская область)",  
    "Берёзовский (Кемеровская область)",  
    "Беслан (Республика Северная Осетия — Алания)",  
    "Бийск (Алтайский край)",  
    "Бикин (Хабаровский край)",  
    "Билибино (Чукотский автономный округ)",  
    "Биробиджан (Еврейская автономная область)",  
    "Бирск (Республика Башкортостан)",  
    "Бирюсинск (Иркутская область)",  
    "Бирюч (Белгородская область)",  
    "Благовещенск (Амурская область)",  
    "Благовещенск (Республика Башкортостан)",  
    "Благодарный (Ставропольский край)",  
    "Бобров (Воронежская область)",  
    "Богданович (Свердловская область)",  
    "Богородицк (Тульская область)",  
    "Богородск (Нижегородская область)",
    "Боготол (Красноярский край)",  
    "Богучар (Воронежская область)",  
    "Бодайбо (Иркутская область)",  
    "Бокситогорск (Ленинградская область)",  
    "Болгар (Республика Татарстан)",  
    "Бологое (Тверская область)",  
    "Болотное (Новосибирская область)",  
    "Болохово (Тульская область)",  
    "Болхов (Орловская область)",  
    "Большой Камень (Приморский край)",  
    "Бор (Нижегородская область)",  
    "Борзя (Забайкальский край)",  
    "Борисоглебск (Воронежская область)",  
    "Боровичи (Новгородская область)",  
    "Боровск (Калужская область)",  
    "Бородино (Красноярский край)",  
    "Братск (Иркутская область)",  
    "Бронницы (Московская область)",  
    "Брянск (Брянская область)",  
    "Бугульма (Республика Татарстан)",  
    "Бугуруслан (Оренбургская область)",  
    "Будённовск (Ставропольский край)",  
    "Бузулук (Оренбургская область)",  
    "Буинск (Республика Татарстан)",  
    "Буй (Костромская область)",  
    "Буйнакск (Республика Дагестан)",  
    "Бутурлиновка (Воронежская область)",
    "Валдай (Новгородская область)",  
    "Валуйки (Белгородская область)",  
    "Велиж (Смоленская область)",  
    "Великие Луки (Псковская область)",  
    "Великий Новгород (Новгородская область)",  
    "Великий Устюг (Вологодская область)",  
    "Вельск (Архангельская область)",  
    "Венёв (Тульская область)",  
    "Верещагино (Пермский край)",  
    "Верея (Московская область)",  
    "Верхнеуральск (Челябинская область)",  
    "Верхний Тагил (Свердловская область)",  
    "Верхний Уфалей (Челябинская область)",  
    "Верхняя Пышма (Свердловская область)",  
    "Верхняя Салда (Свердловская область)",  
    "Верхняя Тура (Свердловская область)",  
    "Верхотурье (Свердловская область)",  
    "Верхоянск (Республика Саха — Якутия)",  
    "Весьегонск (Тверская область)",  
    "Ветлуга (Нижегородская область)",  
    "Видное (Московская область)",  
    "Вилюйск (Республика Саха — Якутия)",  
    "Вилючинск (Камчатский край)",  
    "Вихоревка (Иркутская область)",  
    "Вичуга (Ивановская область)",  
    "Владивосток (Приморский край)",  
    "Владикавказ (Республика Северная Осетия — Алания)",  
    "Владимир (Владимирская область)",  
    "Волгоград (Волгоградская область)",  
    "Волгодонск (Ростовская область)",  
    "Волгореченск (Костромская область)",  
    "Волжск (Республика Марий Эл)",  
    "Волжский (Волгоградская область)",  
    "Вологда (Вологодская область)",  
    "Володарск (Нижегородская область)",  
    "Волоколамск (Московская область)",  
    "Волосово (Ленинградская область)",  
    "Волхов (Ленинградская область)",  
    "Волчанск (Свердловская область)",  
    "Вольск (Саратовская область)",  
    "Воркута (Республика Коми)",  
    "Воронеж (Воронежская область)",  
    "Ворсма (Нижегородская область)",  
    "Воскресенск (Московская область)",  
    "Воткинск (Удмуртская Республика)",  
    "Всеволожск (Ленинградская область)",  
    "Вуктыл (Республика Коми)",  
    "Выборг (Ленинградская область)",  
    "Выкса (Нижегородская область)",  
    "Высоковск (Московская область)",  
    "Высоцк (Ленинградская область)",  
    "Вытегра (Вологодская область)",  
    "Вышний Волочёк (Тверская область)",  
    "Вяземский (Хабаровский край)",  
    "Вязники (Владимирская область)",  
    "Вязьма (Смоленская область)",  
    "Вятские Поляны (Кировская область)",  
    "Гаврилов Посад (Ивановская область)",  
    "Гаврилов-Ям (Ярославская область)",  
    "Гагарин (Смоленская область)",  
    "Гаджиево (Мурманская область)",  
    "Гай (Оренбургская область)",  
    "Галич (Костромская область)",  
    "Гатчина (Ленинградская область)",  
    "Гвардейск (Калининградская область)",  
    "Гдов (Псковская область)",  
    "Геленджик (Краснодарский край)",  
    "Георгиевск (Ставропольский край)",  
    "Глазов (Удмуртская Республика)",  
    "Голицыно (Московская область)",  
    "Горбатов (Нижегородская область)",  
    "Горно-Алтайск (Республика Алтай)",  
    "Горнозаводск (Пермский край)",  
    "Горняк (Алтайский край)",  
    "Городец (Нижегородская область)",  
    "Городище (Пензенская область)",  
    "Городовиковск (Республика Калмыкия)",  
    "Гороховец (Владимирская область)",  
    "Горячий Ключ (Краснодарский край)",  
    "Грайворон (Белгородская область)",  
    "Гремячинск (Пермский край)",  
    "Грозный (Чеченская Республика)",  
    "Грязи (Липецкая область)",  
    "Грязовец (Вологодская область)",  
    "Губаха (Пермский край)",  
    "Губкин (Белгородская область)",  
    "Губкинский (Ямало-Ненецкий автономный округ)",  
    "Гудермес (Чеченская Республика)",  
    "Гуково (Ростовская область)",  
    "Гулькевичи (Краснодарский край)",  
    "Гурьевск (Калининградская область)",  
    "Гурьевск (Кемеровская область)",  
    "Гусев (Калининградская область)",  
    "Гусиноозёрск (Республика Бурятия)",  
    "Гусь-Хрустальный (Владимирская область)",  
    "Давлеканово (Республика Башкортостан)",  
    "Дагестанские Огни (Республика Дагестан)",  
    "Далматово (Курганская область)",  
    "Дальнегорск (Приморский край)",  
    "Дальнереченск (Приморский край)",  
    "Данилов (Ярославская область)",  
    "Данков (Липецкая область)",  
    "Дегтярск (Свердловская область)",  
    "Дедовск (Московская область)",  
    "Демидов (Смоленская область)",  
    "Дербент (Республика Дагестан)",  
    "Десногорск (Смоленская область)",  
    "Джанкой (Республика Крым)",  
    "Дзержинск (Нижегородская область)",  
    "Дзержинский (Московская область)",  
    "Дивногорск (Красноярский край)",
    "Димитровград (Ульяновская область)",  
    "Дмитриев (Курская область)",  
    "Дмитров (Московская область)",  
    "Дмитровск (Орловская область)",  
    "Дно (Псковская область)",  
    "Добрянка (Пермский край)",  
    "Долгопрудный (Московская область)",  
    "Долинск (Сахалинская область)",  
    "Домодедово (Московская область)",  
    "Донецк (Ростовская область)",  
    "Донской (Тульская область)",  
    "Дорогобуж (Смоленская область)",  
    "Дрезна (Московская область)",  
    "Дубна (Московская область)",  
    "Дубовка (Волгоградская область)",  
    "Дудинка (Красноярский край)",  
    "Духовщина (Смоленская область)",  
    "Дюртюли (Республика Башкортостан)",  
    "Дятьково (Брянская область)",  
    "Евпатория (Республика Крым)",  
    "Егорьевск (Московская область)",  
    "Ейск (Краснодарский край)",  
    "Екатеринбург (Свердловская область)",  
    "Елабуга (Республика Татарстан)",  
    "Елец (Липецкая область)",  
    "Елизово (Камчатский край)",  
    "Ельня (Смоленская область)",  
    "Еманжелинск (Челябинская область)",  
    "Емва (Республика Коми)",  
    "Енисейск (Красноярский край)",  
    "Ермолино (Калужская область)",  
    "Ершов (Саратовская область)",  
    "Ессентуки (Ставропольский край)",  
    "Железноводск (Ставропольский край)",  
    "Железногорск (Красноярский край)",  
    "Железногорск (Курская область)",  
    "Железногорск-Илимский (Иркутская область)",  
    "Жердевка (Тамбовская область)",  
    "Жигулёвск (Самарская область)",  
    "Жиздра (Калужская область)",  
    "Жирновск (Волгоградская область)",  
    "Жуков (Калужская область)",  
    "Жуковка (Брянская область)",  
    "Жуковский (Московская область)",  
    "Завитинск (Амурская область)",  
    "Заводоуковск (Тюменская область)",  
    "Заволжск (Ивановская область)",  
    "Заволжье (Нижегородская область)",  
    "Задонск (Липецкая область)",  
    "Заинск (Республика Татарстан)",  
    "Закаменск (Республика Бурятия)",  
    "Заозёрный (Красноярский край)",  
    "Заозёрск (Мурманская область)",  
    "Западная Двина (Тверская область)",  
    "Заполярный (Мурманская область)",  
    "Зарайск (Московская область)",  
    "Заречный (Пензенская область)",  
    "Заречный (Свердловская область)",  
    "Заринск (Алтайский край)",  
    "Звенигово (Республика Марий Эл)",  
    "Звенигород (Московская область)",  
    "Зверево (Ростовская область)",  
    "Зеленогорск (Красноярский край)",  
    "Зеленоградск (Калининградская область)",  
    "Зеленодольск (Республика Татарстан)",  
    "Зеленокумск (Ставропольский край)",  
    "Зерноград (Ростовская область)",  
    "Зея (Амурская область)",  
    "Зима (Иркутская область)",  
    "Златоуст (Челябинская область)",  
    "Злынка (Брянская область)",  
    "Змеиногорск (Алтайский край)",  
    "Знаменск (Астраханская область)",  
    "Зубцов (Тверская область)",  
    "Зуевка (Кировская область)",  
    "Ивангород (Ленинградская область)",  
    "Иваново (Ивановская область)",  
    "Ивантеевка (Московская область)",  
    "Ивдель (Свердловская область)",  
    "Игарка (Красноярский край)",  
    "Ижевск (Удмуртская Республика)",  
    "Избербаш (Республика Дагестан)",  
    "Изобильный (Ставропольский край)",  
    "Иланский (Красноярский край)",  
    "Инза (Ульяновская область)",  
    "Иннополис (Республика Татарстан)",  
    "Инсар (Республика Мордовия)",  
    "Инта (Республика Коми)",  
    "Ипатово (Ставропольский край)",  
    "Ирбит (Свердловская область)",  
    "Иркутск (Иркутская область)",  
    "Исилькуль (Омская область)",  
    "Искитим (Новосибирская область)",  
    "Истра (Московская область)",  
    "Ишим (Тюменская область)",  
    "Ишимбай (Республика Башкортостан)",
    "Йошкар-Ола (Республика Марий Эл)",  
    "Кадников (Вологодская область)",  
    "Казань (Республика Татарстан)",  
    "Калач (Воронежская область)",  
    "Калач-на-Дону (Волгоградская область)",  
    "Калачинск (Омская область)",  
    "Калининград (Калининградская область)",  
    "Калининск (Саратовская область)",  
    "Калтан (Кемеровская область)",  
    "Калуга (Калужская область)",  
    "Калязин (Тверская область)",  
    "Камбарка (Удмуртская Республика)",  
    "Каменка (Пензенская область)",  
    "Каменногорск (Ленинградская область)",  
    "Каменск-Уральский (Свердловская область)",  
    "Каменск-Шахтинский (Ростовская область)",  
    "Камень-на-Оби (Алтайский край)",  
    "Камешково (Владимирская область)",  
    "Камызяк (Астраханская область)",  
    "Камышин (Волгоградская область)",  
    "Камышлов (Свердловская область)",  
    "Канаш (Чувашская Республика)",  
    "Кандалакша (Мурманская область)",  
    "Канск (Красноярский край)",  
    "Карабаново (Владимирская область)",  
    "Карабаш (Челябинская область)",  
    "Карабулак (Республика Ингушетия)",  
    "Карасук (Новосибирская область)",  
    "Карачаевск (Карачаево-Черкесская Республика)",  
    "Карачев (Брянская область)",  
    "Каргат (Новосибирская область)",  
    "Каргополь (Архангельская область)",  
    "Карпинск (Свердловская область)",  
    "Карталы (Челябинская область)",  
    "Касимов (Рязанская область)",  
    "Касли (Челябинская область)",  
    "Каспийск (Республика Дагестан)",  
    "Катав-Ивановск (Челябинская область)",  
    "Катайск (Курганская область)",  
    "Качканар (Свердловская область)",  
    "Кашин (Тверская область)",  
    "Кашира (Московская область)",  
    "Кедровый (Томская область)",  
    "Кемерово (Кемеровская область)",  
    "Кемь (Республика Карелия)",  
    "Керчь (Республика Крым)",  
    "Кизел (Пермский край)",  
    "Кизилюрт (Республика Дагестан)",  
    "Кизляр (Республика Дагестан)",  
    "Кимовск (Тульская область)",  
    "Кимры (Тверская область)",  
    "Кингисепп (Ленинградская область)",  
    "Кинель (Самарская область)",  
    "Кинешма (Ивановская область)",  
    "Киреевск (Тульская область)",  
    "Киренск (Иркутская область)",  
    "Киржач (Владимирская область)",  
    "Кириллов (Вологодская область)",  
    "Кириши (Ленинградская область)",  
    "Киров (Кировская область)",  
    "Киров (Калужская область)",  
    "Кировград (Свердловская область)",  
    "Кирово-Чепецк (Кировская область)",  
    "Кировск (Ленинградская область)",  
    "Кировск (Мурманская область)",  
    "Кирс (Кировская область)",  
    "Кирсанов (Тамбовская область)",  
    "Киселёвск (Кемеровская область)",  
    "Кисловодск (Ставропольский край)",  
    "Клин (Московская область)",  
    "Клинцы (Брянская область)",  
    "Княгинино (Нижегородская область)",  
    "Ковдор (Мурманская область)",  
    "Ковров (Владимирская область)",  
    "Ковылкино (Республика Мордовия)",  
    "Когалым (Ханты-Мансийский автономный округ — Югра)",  
    "Кодинск (Красноярский край)",  
    "Козельск (Калужская область)",  
    "Козловка (Чувашская Республика)",  
    "Козьмодемьянск (Республика Марий Эл)",  
    "Кола (Мурманская область)",  
    "Кологрив (Костромская область)",  
    "Коломна (Московская область)",  
    "Колпашево (Томская область)",  
    "Кольчугино (Владимирская область)",  
    "Коммунар (Ленинградская область)",  
    "Комсомольск-на-Амуре (Хабаровский край)",  
    "Комсомольск (Ивановская область)",  
    "Конаково (Тверская область)",  
    "Кондопога (Республика Карелия)",  
    "Кондрово (Калужская область)",  
    "Копейск (Челябинская область)",  
    "Кораблино (Рязанская область)",  
    "Кореновск (Краснодарский край)",  
    "Коркино (Челябинская область)",  
    "Королёв (Московская область)",  
    "Короча (Белгородская область)",  
    "Корсаков (Сахалинская область)",  
    "Коряжма (Архангельская область)",  
    "Костерёво (Владимирская область)",  
    "Костомукша (Республика Карелия)",  
    "Кострома (Костромская область)",  
    "Котельники (Московская область)",  
    "Котельниково (Волгоградская область)",  
    "Котельнич (Кировская область)",  
    "Котлас (Архангельская область)",  
    "Котово (Волгоградская область)",  
    "Котовск (Тамбовская область)",  
    "Кохма (Ивановская область)",  
    "Красавино (Вологодская область)",  
    "Красноармейск (Московская область)",  
    "Красноармейск (Саратовская область)",  
    "Красновишерск (Пермский край)",
    "Красногорск (Московская область)",  
    "Краснодар (Краснодарский край)",  
    "Краснозаводск (Московская область)",  
    "Краснознаменск (Калининградская область)",  
    "Краснознаменск (Московская область)",  
    "Краснокаменск (Забайкальский край)",  
    "Краснокамск (Пермский край)",  
    "Красноперекопск (Республика Крым)",  
    "Краснослободск (Волгоградская область)",  
    "Краснослободск (Республика Мордовия)",  
    "Краснотурьинск (Свердловская область)",  
    "Красноуральск (Свердловская область)",  
    "Красноуфимск (Свердловская область)",  
    "Красноярск (Красноярский край)",  
    "Красный Кут (Саратовская область)",  
    "Красный Сулин (Ростовская область)",  
    "Красный Холм (Тверская область)",  
    "Кремёнки (Калужская область)",  
    "Кропоткин (Краснодарский край)",  
    "Крымск (Краснодарский край)",  
    "Кстово (Нижегородская область)",  
    "Кубинка (Московская область)",  
    "Кувандык (Оренбургская область)",  
    "Кувшиново (Тверская область)",  
    "Кудрово (Ленинградская область)",  
    "Кудымкар (Пермский край)",  
    "Кузнецк (Пензенская область)",  
    "Куйбышев (Новосибирская область)",  
    "Кукмор (Республика Татарстан)",  
    "Кулебаки (Нижегородская область)",  
    "Кумертау (Республика Башкортостан)",  
    "Кунгур (Пермский край)",  
    "Купино (Новосибирская область)",  
    "Курган (Курганская область)",  
    "Курганинск (Краснодарский край)",  
    "Курильск (Сахалинская область)",  
    "Курлово (Владимирская область)",  
    "Куровское (Московская область)",  
    "Курск (Курская область)",  
    "Куртамыш (Курганская область)",  
    "Курчатов (Курская область)",  
    "Куса (Челябинская область)",  
    "Кушва (Свердловская область)",  
    "Кызыл (Республика Тыва)",  
    "Кыштым (Челябинская область)",  
    "Кяхта (Республика Бурятия)",
    "Лабинск (Краснодарский край)",  
    "Лабытнанги (Ямало-Ненецкий автономный округ)",  
    "Лагань (Республика Калмыкия)",  
    "Ладушкин (Калининградская область)",  
    "Лаишево (Республика Татарстан)",  
    "Лакинск (Владимирская область)",  
    "Лангепас (Ханты-Мансийский автономный округ — Югра)",  
    "Лахденпохья (Республика Карелия)",  
    "Лебедянь (Липецкая область)",  
    "Лениногорск (Республика Татарстан)",  
    "Ленинск (Волгоградская область)",  
    "Ленинск-Кузнецкий (Кемеровская область)",  
    "Ленск (Республика Саха — Якутия)",  
    "Лермонтов (Ставропольский край)",  
    "Лесной (Свердловская область)",  
    "Лесозаводск (Приморский край)",  
    "Лесосибирск (Красноярский край)",  
    "Ливны (Орловская область)",  
    "Ликино-Дулёво (Московская область)",  
    "Липецк (Липецкая область)",  
    "Липки (Тульская область)",  
    "Лиски (Воронежская область)",  
    "Лихославль (Тверская область)",  
    "Лобня (Московская область)",  
    "Лодейное Поле (Ленинградская область)",  
    "Лосино-Петровский (Московская область)",  
    "Луга (Ленинградская область)",  
    "Луза (Кировская область)",  
    "Лукоянов (Нижегородская область)",  
    "Луховицы (Московская область)",  
    "Лысково (Нижегородская область)",  
    "Лысьва (Пермский край)",  
    "Лыткарино (Московская область)",  
    "Льгов (Курская область)",  
    "Любань (Ленинградская область)",  
    "Люберцы (Московская область)",  
    "Любим (Ярославская область)",  
    "Людиново (Калужская область)",  
    "Магадан (Магаданская область)",  
    "Магас (Республика Ингушетия)",  
    "Магнитогорск (Челябинская область)",  
    "Майкоп (Республика Адыгея)",  
    "Майский (Кабардино-Балкарская Республика)",  
    "Макаров (Сахалинская область)",  
    "Макарьев (Костромская область)",  
    "Макушино (Курганская область)",  
    "Малая Вишера (Новгородская область)",  
    "Малгобек (Республика Ингушетия)",  
    "Малмыж (Кировская область)",  
    "Малоархангельск (Орловская область)",  
    "Малоярославец (Калужская область)",  
    "Мамадыш (Республика Татарстан)",  
    "Мамоново (Калининградская область)",  
    "Мантурово (Костромская область)",  
    "Мариинск (Кемеровская область)",  
    "Мариинский Посад (Чувашская Республика)",  
    "Маркс (Саратовская область)",  
    "Махачкала (Республика Дагестан)",  
    "Мглин (Брянская область)",  
    "Мегион (Ханты-Мансийский автономный округ — Югра)",  
    "Медвежьегорск (Республика Карелия)",  
    "Медногорск (Оренбургская область)",  
    "Медынь (Калужская область)",  
    "Межгорье (Республика Башкортостан)",  
    "Междуреченск (Кемеровская область)",  
    "Мезень (Архангельская область)",  
    "Меленки (Владимирская область)",  
    "Мелеуз (Республика Башкортостан)",  
    "Менделеевск (Республика Татарстан)",  
    "Мензелинск (Республика Татарстан)",  
    "Мещовск (Калужская область)",  
    "Миасс (Челябинская область)",  
    "Микунь (Республика Коми)",  
    "Миллерово (Ростовская область)",  
    "Минеральные Воды (Ставропольский край)",  
    "Минусинск (Красноярский край)",  
    "Миньяр (Челябинская область)",  
    "Мирный (Архангельская область)",  
    "Мирный (Республика Саха — Якутия)",  
    "Михайлов (Рязанская область)",  
    "Михайловка (Волгоградская область)",  
    "Михайловск (Свердловская область)",  
    "Михайловск (Ставропольский край)",  
    "Мичуринск (Тамбовская область)",  
    "Могоча (Забайкальский край)",  
    "Можайск (Московская область)",  
    "Можга (Удмуртская Республика)",  
    "Моздок (Республика Северная Осетия — Алания)",  
    "Мончегорск (Мурманская область)",  
    "Морозовск (Ростовская область)",  
    "Моршанск (Тамбовская область)",  
    "Мосальск (Калужская область)",  
    "Москва",  
    "Московский (Московская область)",  
    "Мурманск (Мурманская область)",  
    "Муром (Владимирская область)",  
    "Мценск (Орловская область)",  
    "Мыски (Кемеровская область)",  
    "Мытищи (Московская область)",  
    "Мышкин (Ярославская область)",  
    "Набережные Челны (Республика Татарстан)",  
    "Навашино (Нижегородская область)",  
    "Наволоки (Ивановская область)",  
    "Надым (Ямало-Ненецкий автономный округ)",  
    "Назарово (Красноярский край)",  
    "Назрань (Республика Ингушетия)",  
    "Называевск (Омская область)",  
    "Нальчик (Кабардино-Балкарская Республика)",  
    "Нариманов (Астраханская область)",  
    "Наро-Фоминск (Московская область)",
    "Нарткала (Кабардино-Балкарская Республика)",  
    "Нарьян-Мар (Ненецкий автономный округ)",  
    "Находка (Приморский край)",  
    "Невель (Псковская область)",  
    "Невельск (Сахалинская область)",  
    "Невинномысск (Ставропольский край)",  
    "Невьянск (Свердловская область)",  
    "Нелидово (Тверская область)",  
    "Неман (Калининградская область)",  
    "Нерехта (Костромская область)",  
    "Нерчинск (Забайкальский край)",  
    "Нерюнгри (Республика Саха — Якутия)",  
    "Нестеров (Калининградская область)",  
    "Нефтегорск (Самарская область)",  
    "Нефтекамск (Республика Башкортостан)",  
    "Нефтекумск (Ставропольский край)",  
    "Нефтеюганск (Ханты-Мансийский автономный округ — Югра)",  
    "Нея (Костромская область)",  
    "Нижневартовск (Ханты-Мансийский автономный округ — Югра)",  
    "Нижнекамск (Республика Татарстан)",  
    "Нижнеудинск (Иркутская область)",  
    "Нижние Серги (Свердловская область)",  
    "Нижний Ломов (Пензенская область)",  
    "Нижний Новгород (Нижегородская область)",  
    "Нижний Тагил (Свердловская область)",  
    "Нижняя Салда (Свердловская область)",  
    "Нижняя Тура (Свердловская область)",  
    "Николаевск (Волгоградская область)",  
    "Николаевск-на-Амуре (Хабаровский край)",  
    "Никольск (Вологодская область)",  
    "Никольск (Пензенская область)",  
    "Никольское (Ленинградская область)",  
    "Новая Ладога (Ленинградская область)",  
    "Новая Ляля (Свердловская область)",  
    "Новоалександровск (Ставропольский край)",  
    "Новоалтайск (Алтайский край)",  
    "Новоаннинский (Волгоградская область)",  
    "Нововоронеж (Воронежская область)",  
    "Новодвинск (Архангельская область)",  
    "Новозыбков (Брянская область)",  
    "Новокубанск (Краснодарский край)",  
    "Новокузнецк (Кемеровская область)",  
    "Новокуйбышевск (Самарская область)",  
    "Новомичуринск (Рязанская область)",  
    "Новомосковск (Тульская область)",  
    "Новопавловск (Ставропольский край)",  
    "Новоржев (Псковская область)",  
    "Новороссийск (Краснодарский край)",  
    "Новосибирск (Новосибирская область)",  
    "Новосиль (Орловская область)",  
    "Новосокольники (Псковская область)",  
    "Новотроицк (Оренбургская область)",  
    "Новоузенск (Саратовская область)",  
    "Новоульяновск (Ульяновская область)",  
    "Новоуральск (Свердловская область)",  
    "Новохопёрск (Воронежская область)",  
    "Новочебоксарск (Чувашская Республика)",  
    "Новочеркасск (Ростовская область)",  
    "Новошахтинск (Ростовская область)",  
    "Новый Оскол (Белгородская область)",  
    "Новый Уренгой (Ямало-Ненецкий автономный округ)",  
    "Ногинск (Московская область)",  
    "Нолинск (Кировская область)",  
    "Норильск (Красноярский край)",  
    "Ноябрьск (Ямало-Ненецкий автономный округ)",  
    "Нурлат (Республика Татарстан)",  
    "Нытва (Пермский край)",  
    "Нюрба (Республика Саха — Якутия)",  
    "Нягань (Ханты-Мансийский автономный округ — Югра)",  
    "Нязепетровск (Челябинская область)",  
    "Няндома (Архангельская область)",
    "Обнинск (Калужская область)",
    "Обоянь (Курская область)",
    "Обь (Новосибирская область)",
    "Одинцово (Московская область)",
    "Озёрск (Калининградская область)",
    "Озёрск (Челябинская область)",
    "Озёры (Московская область)",
    "Октябрьск (Самарская область)",
    "Октябрьский (Республика Башкортостан)",
    "Окуловка (Новгородская область)",
    "Олёкминск (Республика Саха — Якутия)",
    "Оленегорск (Мурманская область)",
    "Олонец (Республика Карелия)",
    "Омск (Омская область)",
    "Омутнинск (Кировская область)",
    "Онега (Архангельская область)",
    "Опочка (Псковская область)",
    "Орёл (Орловская область)",
    "Оренбург (Оренбургская область)",
    "Орехово-Зуево (Московская область)",
    "Орлов (Кировская область)",
    "Орск (Оренбургская область)",
    "Оса (Пермский край)",
    "Осинники (Кемеровская область)",
    "Осташков (Тверская область)",
    "Остров (Псковская область)",
    "Островной (Мурманская область)",
    "Острогожск (Воронежская область)",
    "Отрадное (Ленинградская область)",
    "Отрадный (Самарская область)",
    "Оха (Сахалинская область)",
    "Оханск (Пермский край)",
    "Очёр (Пермский край)",
    "Павлово (Нижегородская область)",
    "Павловск (Воронежская область)",
    "Павловский Посад (Московская область)",
    "Палласовка (Волгоградская область)",
    "Партизанск (Приморский край)",
    "Певек (Чукотский автономный округ)",
    "Пенза (Пензенская область)",
    "Первомайск (Нижегородская область)",
    "Первоуральск (Свердловская область)",
    "Перевоз (Нижегородская область)",
    "Пересвет (Московская область)",
    "Переславль-Залесский (Ярославская область)",
    "Пермь (Пермский край)",
    "Пестово (Новгородская область)",
    "Петров Вал (Волгоградская область)",
    "Петровск (Саратовская область)",
    "Петровск-Забайкальский (Забайкальский край)",
    "Петрозаводск (Республика Карелия)",
    "Петропавловск-Камчатский (Камчатский край)",
    "Петухово (Курганская область)",
    "Петушки (Владимирская область)",
    "Печора (Республика Коми)",
    "Печоры (Псковская область)",
    "Пикалёво (Ленинградская область)",
    "Пионерский (Калининградская область)",
    "Питкяранта (Республика Карелия)",
    "Плавск (Тульская область)",
    "Пласт (Челябинская область)",
    "Плёс (Ивановская область)",
    "Поворино (Воронежская область)",
    "Подольск (Московская область)",
    "Подпорожье (Ленинградская область)",
    "Покачи (Ханты-Мансийский автономный округ — Югра)",
    "Покров (Владимирская область)",
    "Покровск (Республика Саха — Якутия)",
    "Полевской (Свердловская область)",
    "Полесск (Калининградская область)",
    "Полысаево (Кемеровская область)",
    "Полярные Зори (Мурманская область)",
    "Полярный (Мурманская область)",
    "Поронайск (Сахалинская область)",
    "Порхов (Псковская область)",
    "Похвистнево (Самарская область)",
    "Почеп (Брянская область)",
    "Починок (Смоленская область)",
    "Пошехонье (Ярославская область)",
    "Правдинск (Калининградская область)",
    "Приволжск (Ивановская область)",
    "Приморск (Калининградская область)",
    "Приморск (Ленинградская область)",
    "Приморско-Ахтарск (Краснодарский край)",
    "Приозерск (Ленинградская область)",
    "Прокопьевск (Кемеровская область)",
    "Пролетарск (Ростовская область)",
    "Протвино (Московская область)",
    "Прохладный (Кабардино-Балкарская Республика)",
    "Псков (Псковская область)",
    "Пугачёв (Саратовская область)",
    "Пудож (Республика Карелия)",
    "Пустошка (Псковская область)",
    "Пучеж (Ивановская область)",
    "Пушкино (Московская область)",
    "Пущино (Московская область)",
    "Пыталово (Псковская область)",
    "Пыть-Ях (Ханты-Мансийский автономный округ — Югра)",
    "Радужный (Владимирская область)",
    "Радужный (Ханты-Мансийский автономный округ — Югра)",
    "Райчихинск (Амурская область)",
    "Раменское (Московская область)",
    "Рассказово (Тамбовская область)",
    "Ревда (Свердловская область)",
    "Реж (Свердловская область)",
    "Реутов (Московская область)",
    "Ржев (Тверская область)",
    "Родники (Ивановская область)",
    "Рославль (Смоленская область)",
    "Россошь (Воронежская область)",
    "Ростов (Ярославская область)",
    "Ростов-на-Дону (Ростовская область)",
    "Рошаль (Московская область)",
    "Ртищево (Саратовская область)",
    "Рубцовск (Алтайский край)",
    "Рудня (Смоленская область)",
    "Руза (Московская область)",
    "Рузаевка (Республика Мордовия)",
    "Рыбинск (Ярославская область)",
    "Рыбное (Рязанская область)",
    "Рыльск (Курская область)",
    "Ряжск (Рязанская область)",
    "Рязань (Рязанская область)",
    "Саки (Республика Крым)",
    "Салават (Республика Башкортостан)",
    "Салаир (Кемеровская область)",
    "Салехард (Ямало-Ненецкий автономный округ)",
    "Сальск (Ростовская область)",
    "Самара (Самарская область)",
    "Санкт-Петербург",
    "Саранск (Республика Мордовия)",
    "Сарапул (Удмуртская Республика)",
    "Саратов (Саратовская область)",
    "Саров (Нижегородская область)",
    "Сасово (Рязанская область)",
    "Сатка (Челябинская область)",
    "Сафоново (Смоленская область)",
    "Саяногорск (Республика Хакасия)",
    "Саянск (Иркутская область)",
    "Светлогорск (Калининградская область)",
    "Светлоград (Ставропольский край)",
    "Светлый (Калининградская область)",
    "Светогорск (Ленинградская область)",
    "Свирск (Иркутская область)",
    "Свободный (Амурская область)",
    "Себеж (Псковская область)",
    "Севастополь",
    "Северо-Курильск (Сахалинская область)",
    "Северобайкальск (Республика Бурятия)",
    "Северодвинск (Архангельская область)",
    "Североморск (Мурманская область)",
    "Североуральск (Свердловская область)",
    "Северск (Томская область)",
    "Севск (Брянская область)",
    "Сегежа (Республика Карелия)",
    "Сельцо (Брянская область)",
    "Семёнов (Нижегородская область)",
    "Семикаракорск (Ростовская область)",
    "Семилуки (Воронежская область)",
    "Сенгилей (Ульяновская область)",
    "Серафимович (Волгоградская область)",
    "Сергач (Нижегородская область)",
    "Сергиев Посад (Московская область)",
    "Сердобск (Пензенская область)",
    "Серов (Свердловская область)",
    "Серпухов (Московская область)",
    "Сертолово (Ленинградская область)",
    "Сибай (Республика Башкортостан)",
    "Сим (Челябинская область)",
    "Симферополь (Республика Крым)",
    "Сковородино (Амурская область)",
    "Скопин (Рязанская область)",
    "Славгород (Алтайский край)",
    "Славск (Калининградская область)",
    "Славянск-на-Кубани (Краснодарский край)",
    "Сланцы (Ленинградская область)",
    "Слободской (Кировская область)",
    "Слюдянка (Иркутская область)",
    "Смоленск (Смоленская область)",
    "Снежинск (Челябинская область)",
    "Снежногорск (Мурманская область)",
    "Собинка (Владимирская область)",
    "Советск (Калининградская область)",
    "Советск (Кировская область)",
    "Советск (Тульская область)",
    "Советская Гавань (Хабаровский край)",
    "Советский (Ханты-Мансийский автономный округ — Югра)",
    "Сокол (Вологодская область)",
    "Солигалич (Костромская область)",
    "Соликамск (Пермский край)",
    "Солнечногорск (Московская область)",
    "Соль-Илецк (Оренбургская область)",
    "Сольвычегодск (Архангельская область)",
    "Сольцы (Новгородская область)",
    "Сорочинск (Оренбургская область)",
    "Сорск (Республика Хакасия)",
    "Сортавала (Республика Карелия)",
    "Сосенский (Калужская область)",
    "Сосновка (Кировская область)",
    "Сосновоборск (Красноярский край)",
    "Сосновый Бор (Ленинградская область)",
    "Сосногорск (Республика Коми)",
    "Сочи (Краснодарский край)",
    "Спас-Деменск (Калужская область)",
    "Спас-Клепики (Рязанская область)",
    "Спасск-Дальний (Приморский край)",
    "Спасск-Рязанский (Рязанская область)",
    "Спасск (Пензенская область)",
    "Среднеколымск (Республика Саха — Якутия)",
    "Среднеуральск (Свердловская область)",
    "Сретенск (Забайкальский край)",
    "Ставрополь (Ставропольский край)",
    "Старая Купавна (Московская область)",
    "Старая Русса (Новгородская область)",
    "Старица (Тверская область)",
    "Стародуб (Брянская область)",
    "Старый Крым (Республика Крым)",
    "Старый Оскол (Белгородская область)",
    "Стерлитамак (Республика Башкортостан)",
    "Стрежевой (Томская область)",
    "Строитель (Белгородская область)",
    "Струнино (Владимирская область)",
    "Ступино (Московская область)",
    "Суворов (Тульская область)",
    "Судак (Республика Крым)",
    "Суджа (Курская область)",
    "Судогда (Владимирская область)",
    "Суздаль (Владимирская область)",
    "Сунжа (Республика Ингушетия)",
    "Суоярви (Республика Карелия)",
    "Сураж (Брянская область)",
    "Сургут (Ханты-Мансийский автономный округ — Югра)",
    "Суровикино (Волгоградская область)",
    "Сурск (Пензенская область)",
    "Сусуман (Магаданская область)",
    "Сухиничи (Калужская область)",
    "Сухой Лог (Свердловская область)",
    "Сызрань (Самарская область)",
    "Сыктывкар (Республика Коми)",
    "Сысерть (Свердловская область)",
    "Сычёвка (Смоленская область)",
    "Сясьстрой (Ленинградская область)",
    "Тавда (Свердловская область)",
    "Таганрог (Ростовская область)",
    "Тайга (Кемеровская область)",
    "Тайшет (Иркутская область)",
    "Талдом (Московская область)",
    "Талица (Свердловская область)",
    "Тамбов (Тамбовская область)",
    "Тара (Омская область)",
    "Тарко-Сале (Ямало-Ненецкий автономный округ)",
    "Таруса (Калужская область)",
    "Татарск (Новосибирская область)",
    "Таштагол (Кемеровская область)",
    "Тверь (Тверская область)",
    "Теберда (Карачаево-Черкесская Республика)",
    "Тейково (Ивановская область)",
    "Темников (Республика Мордовия)",
    "Темрюк (Краснодарский край)",
    "Терек (Кабардино-Балкарская Республика)",
    "Тетюши (Республика Татарстан)",
    "Тимашёвск (Краснодарский край)",
    "Тихвин (Ленинградская область)",
    "Тихорецк (Краснодарский край)",
    "Тобольск (Тюменская область)",
    "Тогучин (Новосибирская область)",
    "Тольятти (Самарская область)",
    "Томари (Сахалинская область)",
    "Томмот (Республика Саха — Якутия)",
    "Томск (Томская область)",
    "Топки (Кемеровская область)",
    "Торжок (Тверская область)",
    "Торопец (Тверская область)",
    "Тосно (Ленинградская область)",
    "Тотьма (Вологодская область)",
    "Трёхгорный (Челябинская область)",
    "Троицк (Московская область)",
    "Троицк (Челябинская область)",
    "Трубчевск (Брянская область)",
    "Туапсе (Краснодарский край)",
    "Туймазы (Республика Башкортостан)",
    "Тула (Тульская область)",
    "Тулун (Иркутская область)",
    "Туран (Республика Тыва)",
    "Туринск (Свердловская область)",
    "Тутаев (Ярославская область)",
    "Тында (Амурская область)",
    "Тырныауз (Кабардино-Балкарская Республика)",
    "Тюкалинск (Омская область)",
    "Тюмень (Тюменская область)",
    "Уварово (Тамбовская область)",
    "Углегорск (Сахалинская область)",
    "Углич (Ярославская область)",
    "Удачный (Республика Саха — Якутия)",
    "Удомля (Тверская область)",
    "Ужур (Красноярский край)",
    "Узловая (Тульская область)",
    "Улан-Удэ (Республика Бурятия)",
    "Ульяновск (Ульяновская область)",
    "Унеча (Брянская область)",
    "Урай (Ханты-Мансийский автономный округ — Югра)",
    "Урень (Нижегородская область)",
    "Уржум (Кировская область)",
    "Урус-Мартан (Чеченская Республика)",
    "Урюпинск (Волгоградская область)",
    "Усинск (Республика Коми)",
    "Усмань (Липецкая область)",
    "Усолье (Пермский край)",
    "Усолье-Сибирское (Иркутская область)",
    "Уссурийск (Приморский край)",
    "Усть-Джегута (Карачаево-Черкесская Республика)",
    "Усть-Илимск (Иркутская область)",
    "Усть-Катав (Челябинская область)",
    "Усть-Кут (Иркутская область)",
    "Усть-Лабинск (Краснодарский край)",
    "Устюжна (Вологодская область)",
    "Уфа (Республика Башкортостан)",
    "Ухта (Республика Коми)",
    "Учалы (Республика Башкортостан)",
    "Уяр (Красноярский край)",
    "Фатеж (Курская область)",
    "Феодосия (Республика Крым)",
    "Фокино (Брянская область)",
    "Фокино (Приморский край)",
    "Фролово (Волгоградская область)",
    "Фрязино (Московская область)",
    "Хабаровск (Хабаровский край)",
    "Хадыженск (Краснодарский край)",
    "Ханты-Мансийск (Ханты-Мансийский автономный округ — Югра)",
    "Харабали (Астраханская область)",
    "Харовск (Вологодская область)",
    "Хасавюрт (Республика Дагестан)",
    "Хвалынск (Саратовская область)",
    "Хилок (Забайкальский край)",
    "Химки (Московская область)",
    "Холм (Новгородская область)",
    "Холмск (Сахалинская область)",
    "Хотьково (Московская область)",
    "Цивильск (Чувашская Республика)",
    "Цимлянск (Ростовская область)",
    "Циолковский (Амурская область)",
    "Чадан (Республика Тыва)",
    "Чайковский (Пермский край)",
    "Чапаевск (Самарская область)",
    "Чаплыгин (Липецкая область)",
    "Чебаркуль (Челябинская область)",
    "Чебоксары (Чувашская Республика)",
    "Чегем (Кабардино-Балкарская Республика)",
    "Чекалин (Тульская область)",
    "Челябинск (Челябинская область)",
    "Чердынь (Пермский край)",
    "Черемхово (Иркутская область)",
    "Черепаново (Новосибирская область)",
    "Череповец (Вологодская область)",
    "Черкесск (Карачаево-Черкесская Республика)",
    "Чёрмоз (Пермский край)",
    "Черноголовка (Московская область)",
    "Черногорск (Республика Хакасия)",
    "Чернушка (Пермский край)",
    "Черняховск (Калининградская область)",
    "Чехов (Московская область)",
    "Чистополь (Республика Татарстан)",
    "Чита (Забайкальский край)",
    "Чкаловск (Нижегородская область)",
    "Шадринск (Курганская область)",
    "Шали (Чеченская Республика)",
    "Шарыпово (Красноярский край)",
    "Шарья (Костромская область)",
    "Шатура (Московская область)",
    "Шахты (Ростовская область)",
    "Шахунья (Нижегородская область)",
    "Шацк (Рязанская область)",
    "Шебекино (Белгородская область)",
    "Шелехов (Иркутская область)",
    "Шенкурск (Архангельская область)",
    "Шилка (Забайкальский край)",
    "Шимановск (Амурская область)",
    "Шиханы (Саратовская область)",
    "Шлиссельбург (Ленинградская область)",
    "Шумерля (Чувашская Республика)",
    "Шумиха (Курганская область)",
    "Шуя (Ивановская область)",
    "Щёкино (Тульская область)",
    "Щёлкино (Республика Крым)",
    "Щёлково (Московская область)",
    "Щигры (Курская область)",
    "Щучье (Курганская область)",
    "Электрогорск (Московская область)",
    "Электросталь (Московская область)",
    "Электроугли (Московская область)",
    "Элиста (Республика Калмыкия)",
    "Энгельс (Саратовская область)",
    "Эртиль (Воронежская область)",
    "Югорск (Ханты-Мансийский автономный округ — Югра)",
    "Южа (Ивановская область)",
    "Южно-Сахалинск (Сахалинская область)",
    "Южно-Сухокумск (Республика Дагестан)",
    "Южноуральск (Челябинская область)",
    "Юрга (Кемеровская область)",
    "Юрьев-Польский (Владимирская область)",
    "Юрьевец (Ивановская область)",
    "Юрюзань (Челябинская область)",
    "Яблоновский (Республика Адыгея)",
    "Ядрин (Чувашская Республика)",
    "Якутск (Республика Саха — Якутия)",
    "Ялта (Республика Крым)",
    "Ялуторовск (Тюменская область)",
    "Янаул (Республика Башкортостан)",
    "Яранск (Кировская область)",
    "Яровое (Алтайский край)",
    "Ярославль (Ярославская область)",
    "Ярцево (Смоленская область)",
    "Ясногорск (Тульская область)",
    "Ясный (Оренбургская область)",
    "Яхрома (Московская область)"
];

select_city.addEventListener('input', function() {
    const inputValue = this.value.toLowerCase();
    suggest_city.innerHTML = '';
    
    if (inputValue.length > 0) {
        if (select_country.value == 'Россия'){
            let filteredCities = cities.filter(city => {
                // country.toLowerCase().startsWith(inputValue)
                const words = city.toLowerCase().split(/\s+/);
                // Проверяем, есть ли слово, начинающееся с inputValue
                return words.some(word => word.startsWith(inputValue));
            });
            
            if (filteredCities.length > 0) {
                if (filteredCities.length > 15) {
                    filteredCities = filteredCities.slice(0, 15);
                }
                
                filteredCities.forEach(city => {
                    const li = document.createElement('li');
                    li.textContent = city;
                    li.addEventListener('click', function() {
                        select_city.value = this.textContent;
                        suggest_city.innerHTML = '';
                    });
                    
                    suggest_city.appendChild(li);
                });
                
                suggest_city.style.display = 'block';
            
            } else {
                suggest_city.style.display = 'none';
    
            }
        }

    } else {
        suggest_city.style.display = 'none';
    }
    
});

const select_current_city = document.getElementById('current_city');
const suggest_current_city = document.getElementById('suggest_current_city');

select_current_city.addEventListener('input', function() {
    const inputValue = this.value.toLowerCase();
    suggest_current_city.innerHTML = '';
    
    if (inputValue.length > 0) {
        if (select_current_country.value == 'Россия'){
            let filteredCurrentCities = cities.filter(city => {
                // country.toLowerCase().startsWith(inputValue)
                const words = city.toLowerCase().split(/\s+/);
                // Проверяем, есть ли слово, начинающееся с inputValue
                return words.some(word => word.startsWith(inputValue));
            });
            
            if (filteredCurrentCities.length > 0) {
                if (filteredCurrentCities.length > 15) {
                    filteredCurrentCities = filteredCurrentCities.slice(0, 15);
                }
                
                filteredCurrentCities.forEach(city => {
                    const li = document.createElement('li');
                    li.textContent = city;
                    li.addEventListener('click', function() {
                        select_current_city.value = this.textContent;
                        suggest_current_city.innerHTML = '';
                    });
                    
                    suggest_current_city.appendChild(li);
                });
                
                suggest_current_city.style.display = 'block';
            
            } else {
                suggest_current_city.style.display = 'none';
    
            }
        }

    } else {
        suggest_current_city.style.display = 'none';
    }
    
});

document.addEventListener('click', function(event) {
    if (event.target !== select_country && event.target !== suggest_country) {
        suggest_country.innerHTML = '';
        suggest_country.style.display = 'none';
        
        const isValueInCountries = countries.some(country => country === select_country.value);
        
        if (!isValueInCountries) {
            // Если введённое значение не найдено — очищаем поле
            select_country.value = '';
        }
    } 
    if (event.target !== select_current_country && event.target !== suggest_current_country) {
        suggest_current_country.innerHTML = '';
        suggest_current_country.style.display = 'none';
        
        const isValueInCountries = countries.some(country => country === select_current_country.value);
        
        if (!isValueInCountries) {
            // Если введённое значение не найдено — очищаем поле
            select_current_country.value = '';
        }
        
    } 
    if (event.target !== select_city && event.target !== suggest_city) {
        suggest_city.innerHTML = '';
        suggest_city.style.display = 'none';
        
        if (select_country.value == 'Россия'){
            const isValueInCities = cities.some(city => city === select_city.value);
            
            if (!isValueInCities) {
                // Если введённое значение не найдено — очищаем поле
                select_city.value = '';
            }
        }
    } 
    if (event.target !== select_current_city && event.target !== suggest_current_city) {
        suggest_current_city.innerHTML = '';
        suggest_current_city.style.display = 'none';
        
        if (select_current_country.value == 'Россия'){
            const isValueInCities = cities.some(city => city === select_current_city.value);
            
            if (!isValueInCities) {
                // Если введённое значение не найдено — очищаем поле
                select_current_city.value = '';
            }
        }
    }
});

// Разделяем по новой строке и формируем массив
// const citiesArray = cities.split('\n').map(city => city.trim()).filter(city => city.length > 0);
// Преобразуем в JSON (строку)
// const jsonCities = JSON.stringify(citiesArray, null, 2);
// console.log(jsonCities);

// Заполнение списка с разницей в возрасте старше
const gapagesSelect = document.getElementById("gapage");
const gapages = [
    "Категорическое нет", "до 5 лет", "5-10 лет", "до 10 лет", "Не имеет значения"
];
gapages.forEach((gapage) => {
    const option = document.createElement("option");
    option.value = gapage;
    option.textContent = gapage;
    gapagesSelect.appendChild(option);
});

// Заполнение списка с разницей в возрасте младше
const agegapsSelect = document.getElementById("agegap");
const agegaps = [
    "Категорическое нет", "до 5 лет", "5-10 лет", "до 10 лет", "Не имеет значения"
];
agegaps.forEach((agegap) => {
    const option = document.createElement("option");
    option.value = agegap;
    option.textContent = agegap;
    agegapsSelect.appendChild(option);
});
// Заполнение списка со статусом отношений
const statussSelect = document.getElementById("status");
const statuss = [
    "В активном поиске", "Свободна/Свободен", "В отношениях", "Замужем/Женат", "Развод/В разводе"
];
statuss.forEach((status) => {
    const option = document.createElement("option");
    option.value = status;
    option.textContent = status;
    statussSelect.appendChild(option);
});

// Заполнение списка про отношения на расстоянии
const distancesSelect = document.getElementById("distance");
const distances = [
    "Да", "Нет ", "Не уверен(а)"
];
distances.forEach((distance) => {
    const option = document.createElement("option");
    option.value = distance
    option.textContent = distance;
    distancesSelect.appendChild(option);
});

// Заполнение списка про выбор пола
const sexsSelect = document.getElementById("sex");
const sexs = [
    "Мужской", "Женский"
];

sexs.forEach((sex) => {
    const option = document.createElement("option");
    option.value = sex;
    option.textContent = sex;
    sexsSelect.appendChild(option);
});
// Заполнение списка с ориентацией
const orientationsSelect = document.getElementById("orientation");
const orientations = [
    "Гетеросексуал", "Бисексуал", "Гей", "Лесбиянка"
];
orientations.forEach((orientation) => {
    const option = document.createElement("option");
    option.value = orientation;
    option.textContent = orientation;
    orientationsSelect.appendChild(option);
});
// Заполнение списка с целью поисков
const searchingsSelect = document.getElementById("searching");
const searchings = [
    "Найти друзей", "Найти бизнес-партнёра", "Найти человека для путешествий", "Построить отношения", "Построить долгосрочные отношения", "Найти свою любовь", "Найти партнёра для вступления в брак", "Провести время без обязательств 18+"
];
searchings.forEach((searching) => {
    const option = document.createElement("option");
    option.value = searching;
    option.textContent = searching;
    searchingsSelect.appendChild(option);
});
// Заполнение списка с выбором знака зодиака
const signsSelect = document.getElementById("sign");
const signs = [
    "Овен", "Телец", "Близнецы", "Рак ", "Лев", "Дева", "Весы", "Скорпион", "Стрелец", "Козерог", "Водолей", "Рыбы"
];
signs.forEach((sign) => {
    const option = document.createElement("option");
    option.value = sign;
    option.textContent = sign;
    signsSelect.appendChild(option);
});

const give_block = document.querySelector(".give");
function check_give() {
    let checkboxes = give_block.querySelectorAll('input[type="checkbox"]:checked');
    
    if (checkboxes.length >= 5) {
        // Отключаем все неотмеченные чекбоксы
        give_block.querySelectorAll('input[type="checkbox"]:not(:checked)').forEach(function(checkbox) {
            checkbox.disabled = true;
        });
    } else {
        // Включаем все чекбоксы
        give_block.querySelectorAll('input[type="checkbox"]').forEach(function(checkbox) {
            checkbox.disabled = false;
        });
    }
}

const get_block = document.querySelector(".get");
function check_get() {
    let checkboxes = get_block.querySelectorAll('input[type="checkbox"]:checked');
    
    if (checkboxes.length >= 5) {
        // Отключаем все неотмеченные чекбоксы
        get_block.querySelectorAll('input[type="checkbox"]:not(:checked)').forEach(function(checkbox) {
            checkbox.disabled = true;
        });
    } else {
        // Включаем все чекбоксы
        get_block.querySelectorAll('input[type="checkbox"]').forEach(function(checkbox) {
            checkbox.disabled = false;
        });
    }
}

const ycharacter_block = document.querySelector(".my-character");
function check_ycharacter() {
    let checkboxes = ycharacter_block.querySelectorAll('input[type="checkbox"]:checked');
    
    if (checkboxes.length >= 5) {
        // Отключаем все неотмеченные чекбоксы
        ycharacter_block.querySelectorAll('input[type="checkbox"]:not(:checked)').forEach(function(checkbox) {
            checkbox.disabled = true;
        });
    } else {
        // Включаем все чекбоксы
        ycharacter_block.querySelectorAll('input[type="checkbox"]').forEach(function(checkbox) {
            checkbox.disabled = false;
        });
    }
}

const partner_block = document.querySelector(".partner-character");
function check_partner() {
    let checkboxes = partner_block.querySelectorAll('input[type="checkbox"]:checked');
    
    if (checkboxes.length >= 5) {
        // Отключаем все неотмеченные чекбоксы
        partner_block.querySelectorAll('input[type="checkbox"]:not(:checked)').forEach(function(checkbox) {
            checkbox.disabled = true;
        });
    } else {
        // Включаем все чекбоксы
        partner_block.querySelectorAll('input[type="checkbox"]').forEach(function(checkbox) {
            checkbox.disabled = false;
        });
    }
}

const evening_block = document.querySelector(".evening");
function check_evening() {
    let checkboxes = evening_block.querySelectorAll('input[type="checkbox"]:checked');
    
    if (checkboxes.length >= 5) {
        // Отключаем все неотмеченные чекбоксы
        evening_block.querySelectorAll('input[type="checkbox"]:not(:checked)').forEach(function(checkbox) {
            checkbox.disabled = true;
        });
    } else {
        // Включаем все чекбоксы
        evening_block.querySelectorAll('input[type="checkbox"]').forEach(function(checkbox) {
            checkbox.disabled = false;
        });
    }
}

// Добавляем обработчик изменения состояния к каждому чекбоксу
give_block.querySelectorAll('input[type="checkbox"]').forEach(function(checkbox) {
    checkbox.addEventListener('change', check_give);
});

get_block.querySelectorAll('input[type="checkbox"]').forEach(function(checkbox) {
    checkbox.addEventListener('change', check_get);
});

ycharacter_block.querySelectorAll('input[type="checkbox"]').forEach(function(checkbox) {
    checkbox.addEventListener('change', check_ycharacter);
});

partner_block.querySelectorAll('input[type="checkbox"]').forEach(function(checkbox) {
    checkbox.addEventListener('change', check_partner);
});

evening_block.querySelectorAll('input[type="checkbox"]').forEach(function(checkbox) {
    checkbox.addEventListener('change', check_evening);
});

